/*Сколько раз встречается максимум
    На стандартном потоке ввода задаётся натуральное число N (N > 0), после которого следует последовательность из N целых чисел.
    На стандартный поток вывода напечатайте, сколько раз в этой последовательности встречается максимум.
    Указание: использовать массивы запрещается.*/

#include <stdio.h>

int main(void) {
    int N;
    scanf("%d", &N);

    int x;
    int max;
    int count = 0;

    for (int i = 0; i < N; i++) {
        scanf("%d", &x);

        if (i == 0 || x > max) {
            max = x;
            count = 1;
        } else if (x == max) {
            count++;
        }
    }

    printf("%d\n", count);

    return 0;
}
